{"/about/":{"data":{"":"This page is WIP"},"title":"About"},"/blog/":{"data":{"do-i-blog#Do I blog?":"Do I blog?"},"title":"Blog"},"/docs/":{"data":{"intro#Intro":"IntroAll my guides/tutorials will we here. You should see them in the left sidebar."},"title":"Docs"},"/docs/pf2e/":{"data":{"changes-to-spells#Changes to Spells":" Some things need change and the list of changes for spells in my games is below. Note: This is section is WIP. Stifling Stillness Full text of the spell. Creatures will become Fatigued only after (Crit)Failing the basic save. They way I read it “as written” would suggest Fatigued just applying even on best results. That seems a bit too much. There might be more changes. ","commonly-used-optional-rules#Commonly used optional rules":" Free Archetype is ON, unless specified in game description. Even though it gives the players a bit more power and can make the balancing more difficult, I still like it. Gradual Ability Boost is also my favorite. Just makes the jump more … gradual. The only limitation is that you can’t get your modifiers to +5 before level 10 ","house-rules#House Rules":"In this section we have some changes to rules/systems in game.\nRecall Knowledge and hidden checks List is here. It’s nothing complicated, just minor adjustments. ","intro#Intro":"Intro I’ve been GMing Pathfinder 2e games for couple years at this point and I’ve collected some ideas on how to do some things a bit defferently (compared to “rules as written”). Some changes might be about balance, some about ease of use, some for fun "},"title":"Pf2e"},"/docs/pf2e/recall-knowlegde/":{"data":{"any-secret-check#Any secret check":" If the check is secret… …you can’t use Hero Points after the roll, because you don’t know the result. but you can use it before the roll to give yourself an advantage. …and you roll it as public, I can ask you to roll again in secret (depends on severity of the check). This is more of a way to stop any attempts at soft cheating ","intro#Intro":"IntroThe purpose of these changes is to make this activity a bit more reliable and to make it clear that “secret” means secret.","recall-knowledge-specifics#Recall Knowledge specifics":" RAW ruling is here. Basic flow should follow the description in the link. Below are differences and clarifications. Repeated attempts You can try to Recall more information after the first attempt Unless you failed critically. Additional attempts will be with higher DC Unless you have new information. Example of this would be a monster using an ability for the first time. Recalling on this specific ability would use the base DC. Feats and abilities For builds heavily relying on Recall Knowledge, there might be exceptions/changes to previously described rules.\nExample: Mastermind Rogue Racket You can choose to do Recall Knowledge to purely serve as a way to make an enemy Off-guard. In that case, you can use the base DC even on repeated attempts. Example: Investigator Known Weakness Class Feat You can choose to use you free Recall Knowledge only for the bonus to attack rolls, thus using the base DC. "},"title":"Recall Knowlegde"},"/docs/phlegmatreec-as-your-gm/":{"data":{"before-the-game#Before the game":" Are you looking to join anything more than a one-shot? I’ll schedule a short interview with you over Discord voice chat. Please make sure to use the microphone you plan to use in actual game session - mic check is on part of the chat. Introductions are next. After introducing myself, I’ll probably ask about your experience with the system and VTT platform. Anything else you are willing to share is a bonus. Q\u0026A Should take 10-20 minutes. Session 0 is gonna be next. Nothing unusual there. Player introductions. Safety tools - more info soon ","how-do-i-run-my-games-then#How do I run my games then?":" these points are true, unless stated otherwise in a more specific page. Fan of player characters No matter the system I’m always fan of the PCs and I’m not playing against players - it’s collaborative storytelling, not some king of Player versus GM. I’m all ears Players are encouraged to talk to me about any issue they might be having\nWould you like to change something in the game? Other player(s) are making the game less enjoyable? Do you have suggestion to improve something? Questions about anything? Need help? … Let’s talk. I’ll do my best to handle anything you bring to my attention.","intro#Intro":"Intro This is a with basic information. Down bellow you can find links to specific game systems and other topics. ","system-specific#System specific":"Pathfinder 2e More info here "},"title":"PhlegmaTREEc as Your GM"}}